NajdBS/STM32_IoT_Gateway_LoRa_GSM_WiFi/Node_LoRa_Transmitter_Code/LORA_TRANSMITTER/SX1278.c
/**
 * Author Wojciech Domski <Wojciech.Domski@gmail.com>
 * www: www.Domski.pl
 *
 * work based on DORJI.COM sample code and
 * https://github.com/realspinner/SX1278_LoRa
 */

#include "SX1278.h"
#include <string.h>
#include "stm32f4xx.h"
uint8_t rxBuffer1[256];
uint8_t readBytes;
int CMD;
//////////////////////////////////
// logic
//////////////////////////////////

void delay(int ncount)
{
	while(ncount--);
}

void config_register(uint8_t reg,uint8_t data)
{
	   GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (reg|0x80);

		 /* Wait until TXE flag is set to send data */
	 	 while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		   GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)	  
		SPI1->DR = data;
		/* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1) 
	
	
}

uint8_t  read_adress(uint8_t adr)
{
	  uint8_t rxByte = 0x00;

	   GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (adr);

		 /* Wait until TXE flag is set to send data */
	 	 while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
			
		  	

	  //SX1278_hw_SetNSS(hw, 0);
	  GPIOA->ODR&=(0<<4);//NSS=0 (PA4=0)
	  //HAL_SPI_TransmitReceive(hw->spi, &txByte, &rxByte, 1);
	
		while (((SPI1->SR)&(1<<7))) {};  // wait for BSY bit to Reset -> This will indicate that SPI is not busy in communication
		SPI1->DR = 0;  // send dummy data
		while (!((SPI1->SR) &(1<<0))){};  // Wait for RXNE to set -> This will indicate that the Rx buffer is not empty
	  rxByte = (SPI1->DR);
			
			GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1) 
	
	//while (HAL_SPI_GetState(hw->spi) != HAL_SPI_STATE_READY);
	return rxByte;
	
	
}


 void SX1278_hw_init(SX1278_hw_t * hw) 
{
	//SX1278_hw_SetNSS(hw, 1);
	GPIOA->ODR|=(1<<4); //(NSS=1) PA4=1
	
	//HAL_GPIO_WritePin(hw->reset.port, hw->reset.pin, GPIO_PIN_SET);
	GPIOB->ODR|=(1<<0); //RESET_PIN=1 (PB1=1)
}




//RESET SX1278 (une impulsion de 1ms sur PB1) 
void SX1278_hw_Reset(SX1278_hw_t * hw)
{
	//SX1278_hw_SetNSS(hw, 1);
	GPIOA->ODR|=(1<<4); //(NSS=1) PA4=1
	
	//HAL_GPIO_WritePin(hw->reset.port, hw->reset.pin, GPIO_PIN_RESET);
	GPIOB->ODR&=~(1<<0); //RESET_PIN=0 (PB1=0)

	SX1278_hw_DelayMs(1);

	//HAL_GPIO_WritePin(hw->reset.port, hw->reset.pin, GPIO_PIN_SET);
  GPIOB->ODR|=(1<<0); //RESET_PIN=1 (PB1=1)
	
	SX1278_hw_DelayMs(100);
}

void SX1278_hw_Reset1(void)
{
	//SX1278_hw_SetNSS(hw, 1);
	GPIOA->ODR|=(1<<4); //(NSS=1) PA4=1
	
	//HAL_GPIO_WritePin(hw->reset.port, hw->reset.pin, GPIO_PIN_RESET);
	GPIOB->ODR&=~(1<<0); //RESET_PIN=0 (PB1=0)

	SX1278_hw_DelayMs(1);

	//HAL_GPIO_WritePin(hw->reset.port, hw->reset.pin, GPIO_PIN_SET);
  GPIOB->ODR|=(1<<0); //RESET_PIN=1 (PB1=1)
	
	SX1278_hw_DelayMs(100);
}



 uint8_t SX1278_hw_SPIReadByte(SX1278_hw_t * hw) 
{
	uint8_t txByte = 0x00;
	uint8_t rxByte = 0x00;

	//SX1278_hw_SetNSS(hw, 0);
	GPIOA->ODR&=(0<<4);//NSS=0 (PA4=0)
	//HAL_SPI_TransmitReceive(hw->spi, &txByte, &rxByte, 1);
	
		while (((SPI1->SR)&(1<<7))) {};  // wait for BSY bit to Reset -> This will indicate that SPI is not busy in communication
		SPI1->DR = 0;  // send dummy data
		while (!((SPI1->SR) &(1<<0))){};  // Wait for RXNE to set -> This will indicate that the Rx buffer is not empty
	  rxByte = (SPI1->DR);
	
	//while (HAL_SPI_GetState(hw->spi) != HAL_SPI_STATE_READY);
	return rxByte;
}

void SX1278_hw_DelayMs(uint32_t msec) 
	{
	//HAL_Delay(msec);
	delay(msec*2000);
}

 

//////////////////////////////////
// logic
//////////////////////////////////




void SX1278_SPIBurstRead(SX1278_t * module, uint8_t addr, uint8_t* rxBuf,uint8_t length) 
{
	  uint8_t i;	
	
	//SX1278_hw_SPICommand(module->hw, addr);
	     GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	     SPI1->CR1 |=  SPI_CR1_SPE;
		   SPI1->DR = (addr); //ADRESSE EN MODE LECTURE

		  /* Wait until TXE flag is set to send data */
	 	   while(!SPI1->SR&0x2){};
	     /* Wait until Busy flag is reset before disabling SPI */
		   while(SPI1->SR&1<<7){};
		   /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		   SPI1->DR;
       SPI1->SR;
	

		for (i =0; i < length; i++) 
		{
			 //*(rxBuf + i) = SX1278_hw_SPIReadByte(module->hw);
			     GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	         while (((SPI1->SR)&(1<<7))) {};  // wait for BSY bit to Reset -> This will indicate that SPI is not busy in communication
		       SPI1->DR = 0;  // send dummy data
		       while (!((SPI1->SR) &(1<<0))){};  // Wait for RXNE to set -> This will indicate that the Rx buffer is not empty
	         *(rxBuf + i)= (SPI1->DR);		
		}
		//SX1278_hw_SetNSS(module->hw, 1);
		GPIOA->ODR|=(1<<4); //(NSS=1) PA4=1
	
}


void SX1278_BurstRead( uint8_t addr, uint8_t* rxBuf,uint8_t length) 
{
	  uint8_t i;	
	
	//SX1278_hw_SPICommand(module->hw, addr);
	     GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	     SPI1->CR1 |=  SPI_CR1_SPE;
		   SPI1->DR = (addr); //ADRESSE EN MODE LECTURE

		  /* Wait until TXE flag is set to send data */
	 	   while(!SPI1->SR&0x2){};
	     /* Wait until Busy flag is reset before disabling SPI */
		   while(SPI1->SR&1<<7){};
		   /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		   SPI1->DR;
       SPI1->SR;
	

		for (i =0; i < length; i++) 
		{
			 //*(rxBuf + i) = SX1278_hw_SPIReadByte(module->hw);
			     GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	         while (((SPI1->SR)&(1<<7))) {};  // wait for BSY bit to Reset -> This will indicate that SPI is not busy in communication
		       SPI1->DR = 0;  // send dummy data
		       while (!((SPI1->SR) &(1<<0))){};  // Wait for RXNE to set -> This will indicate that the Rx buffer is not empty
	         *(rxBuf + i)= (SPI1->DR);		
		}
		//SX1278_hw_SetNSS(module->hw, 1);
		GPIOA->ODR|=(1<<4); //(NSS=1) PA4=1
	
