NajdBS/STM32_IoT_Gateway_LoRa_GSM_WiFi/Node_LoRa_Transmitter_Code/LORA_TRANSMITTER/SX1278.c
void SX1278_config1(void)
{
	//SX1278_sleep(module); //Change modem mode Must in Sleep mode      OK
	SX1278_sleep1();
	
	
	SX1278_hw_DelayMs(15);

	//SX1278_entryLoRa(module); //OK
	SX1278_entryLoRa1();
	//SX1278_SPIWrite(module, 0x5904); //?? Change digital regulator form 1.6V to 1.47V: see errata note

	//SX1278_SPIBurstWrite(module, LR_RegFrMsb,(uint8_t*) SX1278_Frequency[frequency], 3); //setting  frequency parameter     OK
	   GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (LR_RegFrMsb|0x80);

		 /* Wait until TXE flag is set to send data */
	 	 while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
			  
		SPI1->DR = (0x6C);
		/* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(!SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		SPI1->DR = (0x80);
		/* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		SPI1->DR = (0x00);
		/* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		
		GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1) 
	
	
	
	//setting base parameter
	//SX1278_SPIWrite(module, LR_RegPaConfig, SX1278_Power[power]); //Setting output power parameter   OK
      config_register(LR_RegPaConfig,SX1278_Power[SX1278_POWER_17DBM]);  
	   
	
	//SX1278_SPIWrite(module, LR_RegOcp, 0x0B);			//RegOcp,Close Ocp     //OK
			config_register(LR_RegOcp, 0x0B);
	   
	
	
	//SX1278_SPIWrite(module, LR_RegLna, 0x23);		//RegLNA,High & LNA Enable       OK
	  config_register(LR_RegLna, 0x23);
			
			  
	
	
	
		//SX1278_SPIWrite(module,LR_RegModemConfig1,((SX1278_LoRaBandwidth[LoRa_BW] << 4) + (SX1278_CR << 1) + 0x00)); //Explicit Enable CRC Enable(0x02) & Error Coding rate 4/5(0x01), 4/6(0x02), 4/7(0x03), 4/8(0x04)
   // GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
		config_register(LR_RegModemConfig1,((SX1278_LoRaBandwidth[SX1278_LORA_BW_20_8KHZ] << 4) + (SX1278_CR << 1) + 0x00));
		
		//SX1278_SPIWrite(module,LR_RegModemConfig2,((SX1278_SpreadFactor[LoRa_Rate] << 4) + (SX1278_CRC << 2)+ 0x03)); //SFactor &  LNA gain set by the internal AGC loop
	                                               //8<<4+ (1<<2)+0x30
	   config_register(LR_RegModemConfig2,((SX1278_SpreadFactor[SX1278_LORA_SF_8] << 4) + (SX1278_CRC << 2)+ 0x03));
	
	


	//SX1278_SPIWrite(module, LR_RegSymbTimeoutLsb, 0xFF); //RegSymbTimeoutLsb Timeout = 0x3FF(Max)   OK
	 config_register(LR_RegSymbTimeoutLsb, 0xFF);  
	   
	    
   //SX1278_SPIWrite(module, LR_RegPreambleMsb, 0x00); //RegPreambleMsb            OK
		 config_register( LR_RegPreambleMsb, 0x00);
	
	  		
	//SX1278_SPIWrite(module, LR_RegPreambleLsb, 12); //RegPreambleLsb 8+4=12byte Preamble         OK
	   config_register( LR_RegPreambleLsb, 12);
	  
	  
	//SX1278_SPIWrite(module, REG_LR_DIOMAPPING2, 0x01); //RegDioMapping2 DIO5=00, DIO4=01		  OK
	   config_register( REG_LR_DIOMAPPING2, 0x01);
	     	
			
	//module->readBytes = 0;
	//SX1278_standby(module); //Entry standby mode   OK
	SX1278_standby1();
}

void SX1278_standby(SX1278_t * module)
{
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x09);
	   GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (LR_RegOpMode|0x80);

		 /* Wait until TXE flag is set to send data */
	 	while(!SPI1->SR&0x2){};
	/* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
			  
		SPI1->DR = (0x09);
		/* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1)
	    
    module->status = STANDBY;
}

void SX1278_standby1(void)
{
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x09);
	   GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (LR_RegOpMode|0x80);

		 /* Wait until TXE flag is set to send data */
	 	while(!SPI1->SR&0x2){};
	/* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
			  
		SPI1->DR = (0x09);
		/* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
	  /* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1)
}

void SX1278_sleep(SX1278_t * module)
{
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x08);	
	
	  GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (LR_RegOpMode|0x80);
     /* Wait until TXE flag is set to send data */
		  while(!SPI1->SR&0x2){};
		  /* Wait until Busy flag is reset before disabling SPI */
		  while(SPI1->SR&1<<7){};
      /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		 SPI1->DR;
     SPI1->SR;
				
	  GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)	 
		SPI1->DR = (0x08);
		 /* Wait until TXE flag is set to send data */
		 while(!SPI1->SR&0x2){};
			/* Wait until Busy flag is reset before disabling SPI */
		 while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		 SPI1->DR;
     SPI1->SR;
		 GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1)	 
		 
	  // module->status = SLEEP;
}

void SX1278_sleep1(void)
{
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x08);	
	
	  GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	   SPI1->CR1 |=  SPI_CR1_SPE;
		 SPI1->DR = (LR_RegOpMode|0x80);
     /* Wait until TXE flag is set to send data */
		  while(!SPI1->SR&0x2){};
		  /* Wait until Busy flag is reset before disabling SPI */
		  while(SPI1->SR&1<<7){};
      /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		 SPI1->DR;
     SPI1->SR;
				
	  GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)	 
		SPI1->DR = (0x08);
		 /* Wait until TXE flag is set to send data */
		 while(!SPI1->SR&0x2){};
			/* Wait until Busy flag is reset before disabling SPI */
		 while(SPI1->SR&1<<7){};
		 /* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		 SPI1->DR;
     SPI1->SR;
		 GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1)	 
		 
	  // module->status = SLEEP;
}

void SX1278_entryLoRa(SX1278_t * module)
{
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x88);
	
	 GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	 SPI1->CR1 |=  SPI_CR1_SPE;
	 SPI1->DR = (LR_RegOpMode|0x80);
	 /* Wait until TXE flag is set to send data */
	 while(!SPI1->SR&0x2){};
	 /* Wait until Busy flag is reset before disabling SPI */
	 while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
			
	  
		SPI1->DR = (0x88);
	 /* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
		/* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1)			
}

void SX1278_entryLoRa1(void)
{
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x88);
	
	 GPIOA->ODR&=(0<<4); //NSS=0 (PA4=0)
	 SPI1->CR1 |=  SPI_CR1_SPE;
	 SPI1->DR = (LR_RegOpMode|0x80);
	 /* Wait until TXE flag is set to send data */
	 while(!SPI1->SR&0x2){};
	 /* Wait until Busy flag is reset before disabling SPI */
	 while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
			
	  
		SPI1->DR = (0x88);
	 /* Wait until TXE flag is set to send data */
		while(!SPI1->SR&0x2){};
		/* Wait until Busy flag is reset before disabling SPI */
		while(SPI1->SR&1<<7){};
		/* Clear OVERRUN flag in 2 Lines communication mode because received is not read */
		SPI1->DR;
    SPI1->SR;
		GPIOA->ODR|=(1<<4); //NSS=1 (PA4=1)			
}

void SX1278_clearLoRaIrq(SX1278_t * module)
{
	//SX1278_SPIWrite(module, LR_RegIrqFlags, 0xFF);
	config_register(LR_RegIrqFlags,0xFF);
}

void SX1278_clearLoRaIrq1(void)
{
	//SX1278_SPIWrite(module, LR_RegIrqFlags, 0xFF);
	config_register(LR_RegIrqFlags,0xFF);
}

int SX1278_LoRaEntryRx(SX1278_t * module, uint8_t length, uint32_t timeout)
{
	uint8_t addr;

	module->packetLength = length;

	//SX1278_defaultConfig(module);		//Setting base parameter
	SX1278_defaultConfig1();
	
	
	//SX1278_SPIWrite(module, REG_LR_PADAC, 0x84);	//Normal and RX
	config_register(REG_LR_PADAC,0x84);
	
	
