NajdBS/STM32_IoT_Gateway_LoRa_GSM_WiFi/Node_LoRa_Transmitter_Code/LORA_TRANSMITTER/SX1278.c
	//SX1278_SPIWrite(module, LR_RegHopPeriod, 0xFF);	//No FHSS
	  config_register(LR_RegHopPeriod,0xFF);
	
	//SX1278_SPIWrite(module, REG_LR_DIOMAPPING1, 0x01);//DIO=00,DIO1=00,DIO2=00, DIO3=01
	  config_register(REG_LR_DIOMAPPING1,0x01);
	
	//SX1278_SPIWrite(module, LR_RegIrqFlagsMask, 0x3F);//Open RxDone interrupt & Timeout
	  config_register(REG_LR_DIOMAPPING1,0x01);
	
	//SX1278_clearLoRaIrq(module);
	  SX1278_clearLoRaIrq1();
	
	//SX1278_SPIWrite(module, LR_RegPayloadLength, length);//Payload Length 21byte(this register must difine when the data long of one byte in SF is 6)
	  config_register(LR_RegPayloadLength,length);
	
	//addr = SX1278_SPIRead(module, LR_RegFifoRxBaseAddr); //Read RxBaseAddr
	  addr=read_adress(LR_RegFifoRxBaseAddr);
	
	
	//SX1278_SPIWrite(module, LR_RegFifoAddrPtr, addr); //RxBaseAddr->FiFoAddrPtr
	  config_register(LR_RegFifoAddrPtr,addr);
	
	
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x8d);	//Mode//Low Frequency Mode
	  config_register(LR_RegOpMode,0x8d);
	
	//SX1278_SPIWrite(module, LR_RegOpMode,0x05);	//Continuous Rx Mode //High Frequency Mode
	  module->readBytes = 0;

	while (1)
	{
		//if ((SX1278_SPIRead(module, LR_RegModemStat) & 0x04) == 0x04)  //Rx-on going RegModemStat
		//{
			
		//	return 1;
		//}
		
		if ((read_adress(LR_RegModemStat) & 0x04) == 0x04)  //Rx-on going RegModemStat
		{		
			return 1;
		}
		timeout--;
		if (timeout == 0)
		{
			//SX1278_hw_Reset(module->hw);
			SX1278_hw_Reset1();
			
			//SX1278_defaultConfig(module);
			SX1278_defaultConfig1();
			return 0;
		}
		SX1278_hw_DelayMs(1);
	}
}

int SX1278_LoRaEntryRx2(int x, uint8_t length, uint32_t timeout)
{
	uint8_t addr;

	//Setting base parameter
	SX1278_defaultConfig1();	
	
	//Normal and RX
	config_register(REG_LR_PADAC,0x84);
	
	//No FHSS
	config_register(LR_RegHopPeriod,0xFF);
	
	//DIO=00,DIO1=00,DIO2=00, DIO3=01
	config_register(REG_LR_DIOMAPPING1,0x01);
	
	//Open RxDone interrupt & Timeout
	config_register( LR_RegIrqFlagsMask, 0x3F);
	
	
  //CLEAR ALL FLAG
	SX1278_clearLoRaIrq1();
	
	
	//Payload Length 21byte(this register must difine when the data long of one byte in SF is 6)
	config_register(LR_RegPayloadLength,length);
	
 //Read RxBaseAddr
	addr=read_adress(LR_RegFifoRxBaseAddr);
	
	
 //RxBaseAddr->FiFoAddrPtr
	config_register(LR_RegFifoAddrPtr,addr);
	
	//Mode//Low Frequency Mode
	config_register(LR_RegOpMode,0x8d);
	
	//SX1278_SPIWrite(module, LR_RegOpMode,0x05);	//Continuous Rx Mode //High Frequency Mode

  readBytes = 0;
	while (1)
	{
	  //Rx-on going RegModemStat
		if ((read_adress(LR_RegModemStat) & 0x04) == 0x04)  
		{		
			return 1;
		}
		timeout--;
		
		if (timeout == 0)
		{
			//Hardware reset: 
			SX1278_hw_Reset1();
			
			SX1278_defaultConfig1();
			return 0;
		}
		SX1278_hw_DelayMs(1);
	}
}

int SX1278_LoRaEntryRx1(uint8_t length, uint32_t timeout)
{
	uint8_t addr;

	

	//SX1278_defaultConfig(module);		//Setting base parameter
	SX1278_defaultConfig1();
	
	
	//SX1278_SPIWrite(module, REG_LR_PADAC, 0x84);	//Normal and RX
	config_register(REG_LR_PADAC,0x84);
	
	
	//SX1278_SPIWrite(module, LR_RegHopPeriod, 0xFF);	//No FHSS
	  config_register(LR_RegHopPeriod,0xFF);
	
	//SX1278_SPIWrite(module, REG_LR_DIOMAPPING1, 0x01);//DIO=00,DIO1=00,DIO2=00, DIO3=01
	  config_register(REG_LR_DIOMAPPING1,0x01);
	
	//SX1278_SPIWrite(module, LR_RegIrqFlagsMask, 0x3F);//Open RxDone interrupt & Timeout
	  config_register(REG_LR_DIOMAPPING1,0x01);
	
	//SX1278_clearLoRaIrq(module);
	  SX1278_clearLoRaIrq1();
	
	//SX1278_SPIWrite(module, LR_RegPayloadLength, length);//Payload Length 21byte(this register must difine when the data long of one byte in SF is 6)
	  config_register(LR_RegPayloadLength,length);
	
	//addr = SX1278_SPIRead(module, LR_RegFifoRxBaseAddr); //Read RxBaseAddr
	  addr=read_adress(LR_RegFifoRxBaseAddr);
	
	
	//SX1278_SPIWrite(module, LR_RegFifoAddrPtr, addr); //RxBaseAddr->FiFoAddrPtr
	  config_register(LR_RegFifoAddrPtr,addr);
	
	
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x8d);	//Mode//Low Frequency Mode
	  config_register(LR_RegOpMode,0x8d);
	
	//SX1278_SPIWrite(module, LR_RegOpMode,0x05);	//Continuous Rx Mode //High Frequency Mode
	  readBytes = 0;

	while (1)
	{
		//if ((SX1278_SPIRead(module, LR_RegModemStat) & 0x04) == 0x04)  //Rx-on going RegModemStat
		//{
			
		//	return 1;
		//}
		
		if ((read_adress(LR_RegModemStat) & 0x04) == 0x04)  //Rx-on going RegModemStat
		{		
			return 1;
		}
		timeout--;
		if (timeout == 0)
		{
			//SX1278_hw_Reset(module->hw);
			SX1278_hw_Reset1();
			
			//SX1278_defaultConfig(module);
			SX1278_defaultConfig1();
			return 0;
		}
		SX1278_hw_DelayMs(1);
	}
}

uint8_t SX1278_LoRaRxPacket(SX1278_t * module)
{
	unsigned char addr;
	unsigned char packet_size;

	//if (SX1278_hw_GetDIO0(module->hw)) 
	if(GPIOB->IDR&0x1)
	{
		 memset(rxBuffer1, 0x00, SX1278_MAX_PACKET);

		//addr = SX1278_SPIRead(module, LR_RegFifoRxCurrentaddr); //last packet addr
		      addr=read_adress(LR_RegFifoRxCurrentaddr);
		      
		 //SX1278_SPIWrite(module, LR_RegFifoAddrPtr, addr); //RxBaseAddr -> FiFoAddrPtr
           config_register(LR_RegFifoAddrPtr,addr);
		
		
		if (module->LoRa_Rate == SX1278_LORA_SF_6)  //When SpreadFactor is six,will used Implicit Header mode(Excluding internal packet length)
		{	
			packet_size = module->packetLength;
		} 
		else 
		{
		 //	packet_size = SX1278_SPIRead(module, LR_RegRxNbBytes); //Number for received bytes
         packet_size=read_adress(LR_RegRxNbBytes);                			
		}

		//SX1278_SPIBurstRead(module, 0x00,&rxBuffer1[0], packet_size);
		SX1278_BurstRead( 0x00,&rxBuffer1[0], packet_size);
		
		
		module->readBytes = packet_size;
		//SX1278_clearLoRaIrq(module);
		  SX1278_clearLoRaIrq1();
	}
	return module->readBytes;
}


uint8_t SX1278_LoRaRxPacket1(void)
{
	unsigned char addr;
	unsigned char packet_size;

	//if (SX1278_hw_GetDIO0(module->hw)) 
	if(GPIOB->IDR&0x1)
	{
		 memset(rxBuffer1, 0x00, SX1278_MAX_PACKET);

		//addr = SX1278_SPIRead(module, LR_RegFifoRxCurrentaddr); //last packet addr
		      addr=read_adress(LR_RegFifoRxCurrentaddr);
		      
		 //SX1278_SPIWrite(module, LR_RegFifoAddrPtr, addr); //RxBaseAddr -> FiFoAddrPtr
           config_register(LR_RegFifoAddrPtr,addr);
		
		

		
		packet_size=read_adress(LR_RegRxNbBytes); 

		//SX1278_SPIBurstRead(module, 0x00,&rxBuffer1[0], packet_size);
		SX1278_BurstRead( 0x00,&rxBuffer1[0], packet_size);
		
		
		readBytes = packet_size;
		//SX1278_clearLoRaIrq(module);
		SX1278_clearLoRaIrq1();
	}
	return readBytes;
}

int SX1278_LoRaEntryTx(SX1278_t * module, uint8_t length, uint32_t timeout) 
{
	uint8_t addr;
	uint8_t temp;

	//module->packetLength = length;

	//SX1278_defaultConfig(module); //setting base parameter
	SX1278_defaultConfig1();
	
	
	//SX1278_SPIWrite(module, REG_LR_PADAC, 0x87);	//Tx for 20dBm
	config_register(REG_LR_PADAC,0x87);
	
	
	//SX1278_SPIWrite(module, LR_RegHopPeriod, 0x00); //RegHopPeriod NO FHSS
	config_register(LR_RegHopPeriod,0x00);
	
	//SX1278_SPIWrite(module, REG_LR_DIOMAPPING1, 0x41); //DIO0=01, DIO1=00,DIO2=00, DIO3=01
	  config_register(REG_LR_DIOMAPPING1,0x41);
	
