NajdBS/STM32_IoT_Gateway_LoRa_GSM_WiFi/Node_LoRa_Transmitter_Code/LORA_TRANSMITTER/SX1278.c
	//SX1278_clearLoRaIrq(module);
	  SX1278_clearLoRaIrq1();
	
	//SX1278_SPIWrite(module, LR_RegIrqFlagsMask, 0xF7); //Open TxDone interrupt
	config_register(LR_RegIrqFlagsMask,0xF7);
	
	//SX1278_SPIWrite(module, LR_RegPayloadLength, length); //RegPayloadLength 21byte
	config_register(LR_RegPayloadLength,length);
	
	//addr = SX1278_SPIRead(module, LR_RegFifoTxBaseAddr); //RegFiFoTxBaseAddr
	    addr=read_adress(LR_RegFifoTxBaseAddr);
	
	
	//SX1278_SPIWrite(module, LR_RegFifoAddrPtr, addr); //RegFifoAddrPtr
  config_register(LR_RegFifoAddrPtr,addr);
	while (1) 
	{
		//temp = SX1278_SPIRead(module, LR_RegPayloadLength);
		temp=read_adress(LR_RegPayloadLength);
		
		if (temp == length) 
		{
			//module->status = TX;
			return 1;
		}

		if (--timeout == 0) 
		{
			//SX1278_hw_Reset(module->hw);
			SX1278_hw_Reset1();
			
			//SX1278_defaultConfig(module);
			SX1278_defaultConfig1();
			return 0;
		}
	}
}

int SX1278_LoRaEntryTx1( uint8_t length, uint32_t timeout) 
{
	uint8_t addr;
	uint8_t temp;

	//module->packetLength = length;

	//SX1278_defaultConfig(module); //setting base parameter
	SX1278_defaultConfig1();
	
	
	//SX1278_SPIWrite(module, REG_LR_PADAC, 0x87);	//Tx for 20dBm
	config_register(REG_LR_PADAC,0x87);
	
	
	//SX1278_SPIWrite(module, LR_RegHopPeriod, 0x00); //RegHopPeriod NO FHSS
	config_register(LR_RegHopPeriod,0x00);
	
	//SX1278_SPIWrite(module, REG_LR_DIOMAPPING1, 0x41); //DIO0=01, DIO1=00,DIO2=00, DIO3=01
	  config_register(REG_LR_DIOMAPPING1,0x41);
	
	//SX1278_clearLoRaIrq(module);
	  SX1278_clearLoRaIrq1();
	
	//SX1278_SPIWrite(module, LR_RegIrqFlagsMask, 0xF7); //Open TxDone interrupt
	config_register(LR_RegIrqFlagsMask,0xF7);
	
	//SX1278_SPIWrite(module, LR_RegPayloadLength, length); //RegPayloadLength 21byte
	config_register(LR_RegPayloadLength,length);
	
	//addr = SX1278_SPIRead(module, LR_RegFifoTxBaseAddr); //RegFiFoTxBaseAddr
	    addr=read_adress(LR_RegFifoTxBaseAddr);
	
	
	//SX1278_SPIWrite(module, LR_RegFifoAddrPtr, addr); //RegFifoAddrPtr
  config_register(LR_RegFifoAddrPtr,addr);
	while (1) 
	{
		//temp = SX1278_SPIRead(module, LR_RegPayloadLength);
		temp=read_adress(LR_RegPayloadLength);
		
		if (temp == length) 
		{
			//module->status = TX;
			return 1;
		}

		if (--timeout == 0) 
		{
			//SX1278_hw_Reset(module->hw);
			SX1278_hw_Reset1();
			
			//SX1278_defaultConfig(module);
			SX1278_defaultConfig1();
			return 0;
		}
	}
}


int SX1278_LoRaTxPacket(SX1278_t * module, uint8_t* txBuffer, uint8_t length,uint32_t timeout) 
{
	//SX1278_SPIBurstWrite(module, 0x00, txBuffer, length);
	SX1278_BurstWrite(0x00, txBuffer, length);
	
	
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x8b);	//Tx Mode
	 config_register(LR_RegOpMode,0x8b);
	
	while (1) 
	{
		//if (SX1278_hw_GetDIO0(module->hw))  //if(Get_NIRQ()) //Packet send over  
		if(GPIOB->IDR&0x1)
		{
			//SX1278_SPIRead(module, LR_RegIrqFlags);
			read_adress(LR_RegIrqFlags);
			
			
			//SX1278_clearLoRaIrq(module); //Clear irq
			SX1278_clearLoRaIrq1();
			
			//SX1278_standby(module); //Entry Standby mode
			SX1278_standby1();
			return 1;
		}

		if (--timeout == 0) 
		{
			//SX1278_hw_Reset(module->hw);
			SX1278_hw_Reset1();
			
			//SX1278_defaultConfig(module);
			SX1278_defaultConfig1();
			return 0;
		}
		SX1278_hw_DelayMs(1);
	}
}

int SX1278_LoRaTxPacket1(uint8_t* txBuffer, uint8_t length,uint32_t timeout) 
{
	//SX1278_SPIBurstWrite(module, 0x00, txBuffer, length);
	SX1278_BurstWrite(0x00, txBuffer, length);
	
	
	//SX1278_SPIWrite(module, LR_RegOpMode, 0x8b);	//Tx Mode
	 config_register(LR_RegOpMode,0x8b);
	
	while (1) 
	{
		//if (SX1278_hw_GetDIO0(module->hw))  //if(Get_NIRQ()) //Packet send over  
		if(GPIOB->IDR&0x1)
		{
			//SX1278_SPIRead(module, LR_RegIrqFlags);
			read_adress(LR_RegIrqFlags);
			
			
			//SX1278_clearLoRaIrq(module); //Clear irq
			SX1278_clearLoRaIrq1();
			
			//SX1278_standby(module); //Entry Standby mode
			SX1278_standby1();
			return 1;
		}

		if (--timeout == 0) 
		{
			//SX1278_hw_Reset(module->hw);
			SX1278_hw_Reset1();
			
			//SX1278_defaultConfig(module);
			SX1278_defaultConfig1();
			return 0;
		}
		SX1278_hw_DelayMs(1);
	}
}

void SX1278_begin(SX1278_t * module, uint8_t frequency, uint8_t power,uint8_t LoRa_Rate, uint8_t LoRa_BW, uint8_t packetLength)
{
	//SX1278_hw_init(module->hw);
   	//SX1278_hw_SetNSS(hw, 1);
	  GPIOA->ODR|=(1<<4); //(NSS=1) PA4=1
	  //HAL_GPIO_WritePin(hw->reset.port, hw->reset.pin, GPIO_PIN_SET);
	  GPIOB->ODR|=(1<<0); //RESET_PIN=1 (PB1=1)
	
	
	module->frequency = frequency;
	module->power = power;
	module->LoRa_Rate = LoRa_Rate;
	module->LoRa_BW = LoRa_BW;
	module->packetLength = packetLength;
	//SX1278_defaultConfig(module);
	SX1278_defaultConfig1();
}

void SX1278_begin1(void)
{
	SX1278_defaultConfig1();
}

int SX1278_transmit(SX1278_t * module, uint8_t* txBuf, uint8_t length,uint32_t timeout) 
{
	if (SX1278_LoRaEntryTx(module, length, timeout)) 
	{
		return SX1278_LoRaTxPacket(module, txBuf, length, timeout);
	}
	return 0;
}

int SX1278_receive(SX1278_t * module, uint8_t length, uint32_t timeout) 
{
	return SX1278_LoRaEntryRx(module, length, timeout);
}

uint8_t SX1278_available(SX1278_t * module) 
{
	return SX1278_LoRaRxPacket(module);
}

uint8_t SX1278_read(SX1278_t * module, uint8_t* rxBuf, uint8_t length) 
{
	//if (length != module->readBytes)
	//	length = module->readBytes;
	memcpy(rxBuf, rxBuffer1, length);
	rxBuf[length] = '\0';
	module->readBytes = 0;
	return length;
}

uint8_t SX1278_read1( uint8_t* rxBuf, uint8_t length) 
{
	//if (length != module->readBytes)
	//	length = module->readBytes;
	memcpy(rxBuf, rxBuffer1, length);
	rxBuf[length] = '\0';
	readBytes = 0;
	return length;
}


